{"pageProps":{"markdownPost":{"name":null,"url":null,"content":"---\ntitle: HTTP Batch Link\ndescription: Batch multiple operations into a single HTTP request\n---\n\n## Overview\n\n`@apollo/client/link/batch-http` is a terminating link that combines multiple GraphQL\noperations into a single HTTP request. This link batches individual\noperations together into an array that is sent to a single GraphQL endpoint.\n\n```js\nimport { BatchHttpLink } from \"@apollo/client/link/batch-http\";\n\nconst link = new BatchHttpLink({ uri: \"/graphql\" });\n```\n\n## Options\n\nThe batch HTTP link accepts a configuration object that can be used to customize the behavior\nof the link. There are two different categories of options: http and batch.\n\n| Option | Description |\n| - | - |\n| `uri` | The URI key is a string endpoint -- will default to \"/graphql\" if not specified |\n| `includeExtensions` | Allow passing the extensions field to your graphql server, defaults to false |\n| `fetch` | A `fetch` compatible API for making a request |\n| `headers` | An object representing values to be sent as headers on the request |\n| `credentials` | A string representing the credentials policy you want for the fetch call |\n| `fetchOptions` | Any overrides of the fetch options argument to pass to the fetch call. Note that you cannot use batching with the GET HTTP method. |\n\nThe batching options indicate how operations are batched together, the size of batches, and the maximum time a batch will wait before automatically being sent over the network.\n\n| Option | Description |\n| - | - |\n| `batchMax` | A max number of items to batch, defaults at 10 |\n| `batchInterval` | The interval at which to batch (in ms), defaults to 10 |\n| `batchKey` | A function that accepts an operation and returns a string key, which uniquely names the batch the operation belongs to, defaults to returning the same string |\n\n## Fetch polyfill\n\nThe batch HTTP link relies on having `fetch` present in your runtime environment. If you are running on react-native, or modern browsers, this should not be a problem. If you are targeting an environment without `fetch` such as older browsers or the server however, you will need to pass your own `fetch` to the link through its options. We recommend using [`cross-fetch`](https://www.npmjs.com/package/cross-fetch) for older browsers and Node.\n\n## Context\n\nThe batch HTTP link currently uses the context in two different ways, per batch and per query. The context fields below are used per batch and taken from the first operation in the batch.\n\n| Option | Description |\n| - | - |\n| `headers` | An object representing values to be sent as headers on the request |\n| `credentials` | A string representing the credentials policy you want for the fetch call |\n| `uri` | A string of the endpoint you want to fetch from |\n| `fetchOptions` | Any overrides of the fetch options argument to pass to the fetch call |\n| `response` | This is the raw response from the fetch request after it is made |\n\nFor each query, the `http` field is used to modify each individual query in the batch, such as persisted queries (see below).\n\n### Persisted queries\n\nThe batch HTTP link supports an advanced GraphQL feature called persisted queries. This allows you to not send the stringified query over the wire, but instead send some kind of identifier for the query. To support this you need to attach the id somewhere in the extensions field, and pass the following options to the context:\n\n```js\noperation.setContext({\n  http: {\n    includeExtensions: true,\n    includeQuery: false,\n  }\n})\n```\n\nThe context `http` object currently supports two keys:\n\n* `includeExtensions`: Send the extensions object for this request.\n* `includeQuery`: Don't send the `query` field for this request.\n\nOne way to use persisted queries is with [apollo-link-persisted-queries](https://github.com/apollographql/apollo-link-persisted-queries) and [Apollo Server](https://www.apollographql.com/docs/apollo-server/performance/apq/).\n\n## Custom fetching\n\nYou can use the `fetch` option when creating an `HttpLink`, to do a lot of custom networking. This is useful if you want to modify the request based on calculated headers or calculate the uri based on the operation.\n\n### Custom auth\n\n```js\nconst customFetch = (uri, options) => {\n  const { header } = Hawk.client.header(\n    \"http://example.com:8000/resource/1?b=1&a=2\",\n    \"POST\",\n    { credentials: credentials, ext: \"some-app-data\" }\n  );\n  options.headers.Authorization = header;\n  return fetch(uri, options);\n};\n\nconst link = new BatchHttpLink({ fetch: customFetch });\n```\n\n### Dynamic URI\n\n```js\nconst customFetch = (uri, options) => {\n  const operationNames =\n    JSON.parse(options.body).map(operation => operation.operationName);\n  return fetch(`${uri}/graph/graphql?opname=${operationNames}`, options);\n};\n\nconst link = new BatchHttpLink({ fetch: customFetch });\n```\n"}},"__N_SSG":true}