{"pageProps":{"markdownPost":{"name":null,"url":null,"content":"---\nid: forwarding-refs\ntitle: Forwarding Refs\npermalink: docs/forwarding-refs.html\n---\n\nRef forwarding is a technique for automatically passing a [ref](/docs/refs-and-the-dom.html) through a component to one of its children. This is typically not necessary for most components in the application. However, it can be useful for some kinds of components, especially in reusable component libraries. The most common scenarios are described below.\n\n## Forwarding refs to DOM components {#forwarding-refs-to-dom-components}\n\nConsider a `FancyButton` component that renders the native `button` DOM element:\n`embed:forwarding-refs/fancy-button-simple.js`\n\nReact components hide their implementation details, including their rendered output. Other components using `FancyButton` **usually will not need to** [obtain a ref](/docs/refs-and-the-dom.html) to the inner `button` DOM element. This is good because it prevents components from relying on each other's DOM structure too much.\n\nAlthough such encapsulation is desirable for application-level components like `FeedStory` or `Comment`, it can be inconvenient for highly reusable \"leaf\" components like `FancyButton` or `MyTextInput`. These components tend to be used throughout the application in a similar manner as a regular DOM `button` and `input`, and accessing their DOM nodes may be unavoidable for managing focus, selection, or animations.\n\n**Ref forwarding is an opt-in feature that lets some components take a `ref` they receive, and pass it further down (in other words, \"forward\" it) to a child.**\n\nIn the example below, `FancyButton` uses `React.forwardRef` to obtain the `ref` passed to it, and then forward it to the DOM `button` that it renders:\n\n`embed:forwarding-refs/fancy-button-simple-ref.js`\n\nThis way, components using `FancyButton` can get a ref to the underlying `button` DOM node and access it if necessary—just like if they used a DOM `button` directly.\n\nHere is a step-by-step explanation of what happens in the above example:\n\n1. We create a [React ref](/docs/refs-and-the-dom.html) by calling `React.createRef` and assign it to a `ref` variable.\n1. We pass our `ref` down to `<FancyButton ref={ref}>` by specifying it as a JSX attribute.\n1. React passes the `ref` to the `(props, ref) => ...` function inside `forwardRef` as a second argument.\n1. We forward this `ref` argument down to `<button ref={ref}>` by specifying it as a JSX attribute.\n1. When the ref is attached, `ref.current` will point to the `<button>` DOM node.\n\n>Note\n>\n>The second `ref` argument only exists when you define a component with `React.forwardRef` call. Regular function or class components don't receive the `ref` argument, and ref is not available in props either.\n>\n>Ref forwarding is not limited to DOM components. You can forward refs to class component instances, too.\n\n## Note for component library maintainers {#note-for-component-library-maintainers}\n\n**When you start using `forwardRef` in a component library, you should treat it as a breaking change and release a new major version of your library.** This is because your library likely has an observably different behavior (such as what refs get assigned to, and what types are exported), and this can break apps and other libraries that depend on the old behavior.\n\nConditionally applying `React.forwardRef` when it exists is also not recommended for the same reasons: it changes how your library behaves and can break your users' apps when they upgrade React itself.\n\n## Forwarding refs in higher-order components {#forwarding-refs-in-higher-order-components}\n\nThis technique can also be particularly useful with [higher-order components](/docs/higher-order-components.html) (also known as HOCs). Let's start with an example HOC that logs component props to the console:\n`embed:forwarding-refs/log-props-before.js`\n\nThe \"logProps\" HOC passes all `props` through to the component it wraps, so the rendered output will be the same. For example, we can use this HOC to log all props that get passed to our \"fancy button\" component:\n`embed:forwarding-refs/fancy-button.js`\n\nThere is one caveat to the above example: refs will not get passed through. That's because `ref` is not a prop. Like `key`, it's handled differently by React. If you add a ref to a HOC, the ref will refer to the outermost container component, not the wrapped component.\n\nThis means that refs intended for our `FancyButton` component will actually be attached to the `LogProps` component:\n`embed:forwarding-refs/fancy-button-ref.js`\n\nFortunately, we can explicitly forward refs to the inner `FancyButton` component using the `React.forwardRef` API. `React.forwardRef` accepts a render function that receives `props` and `ref` parameters and returns a React node. For example:\n`embed:forwarding-refs/log-props-after.js`\n\n## Displaying a custom name in DevTools {#displaying-a-custom-name-in-devtools}\n\n`React.forwardRef` accepts a render function. React DevTools uses this function to determine what to display for the ref forwarding component.\n\nFor example, the following component will appear as \"*ForwardRef*\" in the DevTools:\n\n`embed:forwarding-refs/wrapped-component.js`\n\nIf you name the render function, DevTools will also include its name (e.g. \"*ForwardRef(myFunction)*\"):\n\n`embed:forwarding-refs/wrapped-component-with-function-name.js`\n\nYou can even set the function's `displayName` property to include the component you're wrapping:\n\n`embed:forwarding-refs/customized-display-name.js`\n"}},"__N_SSG":true}