{"pageProps":{"markdownPost":{"name":null,"url":null,"content":"---\ntitle: Introduction to Apollo Client\nsidebar_title: Introduction\n---\n\nimport { Button } from '@apollo/space-kit/Button';\nimport { Link } from 'gatsby';\nimport { colors } from 'gatsby-theme-apollo-core';\n\n**Apollo Client** is a comprehensive state management library for JavaScript that enables you to manage both local and remote data with GraphQL. Use it to fetch, cache, and modify application data, all while automatically updating your UI.\n\nApollo Client helps you structure code in an economical, predictable, and declarative way that's consistent with modern development practices. The core `@apollo/client` library provides built-in integration with React, and the larger Apollo community maintains [integrations for other popular view layers](#community-integrations).\n\n<div>\n  <Button\n    size=\"large\"\n    as={<Link to=\"/get-started/\" />}\n  >\n    Get started!\n  </Button>\n</div>\n\n## Features\n\n- **Declarative data fetching:** Write a query and receive data without manually tracking loading states.\n- **Excellent developer experience:** Enjoy helpful tooling for TypeScript, Chrome DevTools, and VS Code.\n- **Designed for modern React:** Take advantage of the latest React features, such as hooks.\n- **Incrementally adoptable:** Drop Apollo into any JavaScript app seamlessly.\n- **Universally compatible:** Use any build setup and any GraphQL API.\n- **Community driven:** Share knowledge with thousands of developers, thanks to our active open source community.\n\n## Explore the docs\n\nAfter you [get started](./get-started/), check out the full Apollo Client docs, organized into the following sections on the left:\n\n* **Fetching:** Execute queries and other GraphQL operations on your server. **Definitely read [Queries](./data/queries/) if you haven't yet.**\n* **Caching:** Query your cache directly and make local-only modifications to your data.\n* **Local State:** Manage both local and remotely fetched state with a single API.\n* **Development & testing:** Learn about Apollo Client's language and tooling support.\n* **Performance:** Take advantage of advanced features to optimize performance and user experience.\n* **Integrations:** Explore support for view layers besides React.\n* **Networking:** Learn how Apollo Client communicates over the network by default, along with how to customize this behavior.\n* **API:** Consult the complete API reference for Apollo Client, its React APIs, and additional packages.\n\n## Community integrations\n\nThis site's documentation focuses on React, but Apollo Client supports many other libraries and languages:\n\n- JavaScript\n  - [Angular](https://apollo-angular.com)\n  - [Vue](integrations/integrations/#vue)\n  - [Ember](integrations/integrations/#ember)\n  - Meteor (thanks to [DDP-Apollo](https://github.com/Swydo/ddp-apollo))\n- Web Components\n  - [Apollo Elements](integrations/integrations/#web-components)\n- Native mobile\n  - [Native iOS with Swift](https://www.apollographql.com/docs/ios)\n  - [Native Android with Java and Kotlin](https://www.apollographql.com/docs/android)\n"}},"__N_SSG":true}