{"pageProps":{"markdownPost":{"name":null,"url":null,"content":"<!--[meta]\nsection: tutorials\ntitle: Custom fields\norder: 5\n[meta]-->\n\n# Custom Field: `Stars`\n\nIn this tutorial we will be creating a simple custom Field Type for star ratings ⭐️ ⭐️ ⭐️ ⭐️ ⭐️!\n\nFor this component, our data requirements are simple, we need to store an Integer that represents the number of stars. We can extend the built-in Integer type to leverage its implementation and provide only custom behaviour and UI components where necessary.\n\n## Defining The Field Type\n\nThis is what our custom field's directory will look like once we're finished:\n\n```sh\n.\n└── Stars\n    ├── index.js\n    ├── Implementation.js\n    └── views\n        ├── Cell.js\n        ├── Field.js\n        ├── Filter.js\n        ├── Stars.js\n        ├── star-empty.svg\n        └── star-full.svg\n```\n\nCustom fields should have an `index.js` file which exports a field definition. The field definition pulls together all the parts that make up a field including front-end and back-end code.\n\nFor our Stars field it looks something like this:\n\n```js\nconst { Stars, MongoIntegerInterface, KnexIntegerInterface } = require('./Implementation');\n\nconst { Integer } = require('@keystonejs/fields');\n\nmodule.exports = {\n  type: 'Stars',\n  implementation: Stars,\n  adapters: {\n    mongoose: MongoIntegerInterface,\n    knex: KnexIntegerInterface,\n  },\n  views: {\n    Controller: Integer.views.Controller,\n    Field: require.resolve('./views/Field'),\n    Filter: Integer.views.Filter,\n    Cell: require.resolve('./views/Cell'),\n  },\n};\n```\n\nThe `implementation` and `adapters` reference back-end code used by Keystone, and everything under `views`, references front-end code used in either the Admin UI or GraphQL apps.\n\nYou may have realised now that front-end and back-end code cannot be bundled together in the same file. That's why we use `require.resolve` to provide a string value rather than importing front-end code. The string value is a reference to the location of the files. Keystone has a special build step that compiles front-end code for field types.\n\nNote: If you want to package field types for use outside your own project, there are additional step involved, however these are outside the scope of this tutorial.\n\n## Implementation\n\nLet's start by looking at `Implementation.js`.\n\n```js\nconst { Integer } = require('@keystonejs/fields');\n\nclass Stars extends Integer.implementation {\n  extendAdminMeta(meta) {\n    return { ...meta, starCount: this.config.starCount || 5 };\n  }\n}\n\nmodule.exports = {\n  Stars,\n  MongoIntegerInterface: Integer.adapters.mongoose,\n  KnexIntegerInterface: Integer.adapters.knex,\n};\n```\n\nIt's convention with existing field types to export the field implementation class, together with the adapter interfaces.\n\nAdapters provide an interface between our field and the database. Here we define how a queries and mutations should be translated into SQL or MongoDB actions. Again, as our implementation for the Stars is going to be the same as the Integer field type, we can just re-export the adapters for the Integer field type.\n\nWe're not changing anything about how the data is stored, so for now we're just going to going to re-export the adapters for the `Integer` field.\n\nThe implementation class is used in the Keystone back-end. It defines a number of things. Firstly, the GraphQL interface including types, queries and resolvers; secondly, field properties such as if a field is orderable; and finally, what data Keystone should pass to the Admin UI.\n\nFor our Stars field, the only thing we want to change from the `Integer` implementation is to add configuration option for the number of stars. Because of this we can `extend` the `Integer` implementation class and override the method `extendAdminMeta`.\n\n### Views\n\nNow that we've got the back-end interface in place let's look at the UI components.\n\nThis normally starts with the controller. The controller defines how front-end features work, including: filtering, default values, serialization of data, label resolvers and some GraphQl options. In our example filtering, default values and controller aspect will all be the same as the `Integer` field. So once again, we're just going to reference the Integer controller.\n\n**Note**: `Integer.views.Controller` will also resolve to a path within the `node_modules` folder and will also be bundled by Keystone at build time.\n\nThe rest of the views relate to React components rendered in the Admin UI. We can start by creating a generic `<Stars>` component that will render a number of stars, either solid or outlined, depending on the count and value props. So, a 3 stars out of 5 rating would look like this:\n\n```jsx\n  <Stars count={5} value={3}>\n```\n\nYou can find an example of this component in the [custom-fields demo project](https://github.com/keystonejs/keystone/tree/master/examples/custom-fields/fields/Stars/views/Stars.js).\n\nOnce we have a component for star ratings we can use this in Keystone.\n\n#### Cell\n\nThe cell component is rendered in a table that shows a list of items the in Keystone Admin UI. We're going to use the star component we made. Our cell component is going to make use of the data, which will be the integer value, and the `starCount` field config option we added in the Implementation.js file. You can interact with the cell so we don't provide any `onChange` prop to the component.\n\n```jsx title=/views/Cell.js\n/** @jsx jsx */\n\nimport { jsx } from '@emotion/core';\nimport Stars from './Stars';\n\nexport default function StarsCell({ field, data }) {\n  const { starCount } = field.config;\n  return <Stars count={starCount} value={data} />;\n}\n```\n\n## Field\n\nThe field component provides the main interface used when creating or editing list items in Keystone. To get a consistent look, we're going to import some wrapping components from `@arch-ui/fields`, that's Keystone's UI library. This will render the labels and provided consistent spacing. Other than this we simply delegate the `onChange` event to the `Stars` so that values can be updated when a user clicks on the stars.\n\n```jsx\n/** @jsx jsx */\n\nimport { jsx } from '@emotion/core';\nimport { FieldContainer, FieldLabel, FieldInput } from '@arch-ui/fields';\nimport Stars from './Stars';\n\nconst StarsField = ({ field, value, errors, onChange }) => (\n  <FieldContainer>\n    <FieldLabel htmlFor={`ks-input-${field.path}`} field={field} errors={errors} />\n    <FieldInput>\n      <Stars count={field.config.starCount} value={value} onChange={onChange} />\n    </FieldInput>\n  </FieldContainer>\n);\nexport default StarsField;\n```\n\nThat's it, we now have a basic custom field.\n\n## Next Steps\n\nTake a look at this example and others in the [custom-fields demo project](https://github.com/keystonejs/keystone/tree/master/examples/custom-fields/) in the Keystone repository.\n"}},"__N_SSG":true}