{"pageProps":{"markdownPost":{"name":null,"url":null,"content":"---\ntitle: Retry Link\ndescription: Attempt an operation multiple times if it fails due to network or server errors.\n---\n\n## Overview\n\n`@apollo/client/link/retry` can be used to retry an operation a certain amount of times. This comes in handy when dealing with unreliable communication situations, where you would rather wait longer than explicitly fail an operation. `@apollo/client/link/retry` provides exponential backoff, and jitters delays between attempts by default. It does not (currently) handle retries for GraphQL errors in the response, only for network errors.\n\nAn example use case is to hold on to a request while a network connection is offline, and retry until it comes back online.\n\n```js\nimport { RetryLink } from \"@apollo/client/link/retry\";\n\nconst link = new RetryLink();\n```\n\n## Options\n\nThe standard retry strategy provides exponential backoff with jittering, and takes the following options, grouped into `delay` and `attempt` strategies:\n\n### options.delay\n\n| Option | Description |\n| - | - |\n| `delay.initial` | The number of milliseconds to wait before attempting the first retry. |\n| `delay.max` | The maximum number of milliseconds that the link should wait for any retry. |\n| `delay.jitter` | Whether delays between attempts should be randomized. |\n\n### options.attempts\n\n| Option | Description |\n| - | - |\n| `attempts.max` | The max number of times to try a single operation before giving up. |\n| `attempts.retryIf` | A predicate function that can determine whether a particular response should be retried. |\n\n### Default configuration\n\nThe default configuration is equivalent to:\n\n```ts\nnew RetryLink({\n  delay: {\n    initial: 300,\n    max: Infinity,\n    jitter: true\n  },\n  attempts: {\n    max: 5,\n    retryIf: (error, _operation) => !!error\n  }\n});\n```\n\n## Avoiding thundering herd\n\nStarting with `initialDelay`, the delay of each subsequent retry is increased exponentially, meaning it's multiplied by 2 each time. For example, if `initialDelay` is 100, additional retries will occur after delays of 200, 400, 800, etc.\n\nWith the `jitter` option enabled, delays are randomized anywhere between 0ms (instant), and 2x the configured delay. This way you get the same result on average, but with random delays.\n\nThese two features are combined to help alleviate [the thundering herd problem](https://en.wikipedia.org/wiki/Thundering_herd_problem), by distributing load during major outages. Without these strategies, when your server comes back up it will be hit by all of your clients at once, possibly causing it to go down again.\n\n## Custom strategies\n\nInstead of the options object, you may pass a function for `delay` and/or `attempts`, which implement custom strategies for each. In both cases the function is given the same arguments (`count`, `operation`, `error`).\n\nThe `attempts` function should return a boolean indicating whether the response should be retried. If yes, the `delay` function is then called, and should return the number of milliseconds to delay by.\n\n```js\nimport { RetryLink } from \"@apollo/client/link/retry\";\n\nconst link = new RetryLink({\n  attempts: (count, operation, error) => {\n    return !!error && operation.operationName != 'specialCase';\n  },\n  delay: (count, operation, error) => {\n    return count * 1000 * Math.random();\n  },\n});\n```\n"}},"__N_SSG":true}