{"pageProps":{"markdownPost":{"name":null,"url":null,"content":"---\ntitle: Core pagination API\nsidebar_title: Core API\ndescription: Fetching and caching paginated results\n---\n\nThe Apollo Client APIs described in this article are useful for handling all paginated list fields, regardless of which pagination strategy a field uses.\n\n## The `fetchMore` function\n\nPagination always involves sending followup queries to your GraphQL server to obtain additional pages of results. In Apollo Client, the recommended way to send these followup queries is with the [`fetchMore`](../caching/advanced-topics/#incremental-loading-fetchmore) function. This function is a member of the `ObservableQuery` object returned by `client.watchQuery`, and it's also included in the object returned by the `useQuery` hook:\n\n```js\nconst { loading, data, fetchMore } = useQuery(GET_ITEMS, { //highlight-line\n  variables: {\n    offset: 0,\n    limit: 10\n  },\n});\n```\n\nWhen you then call `fetchMore`, you can provide a new set of `variables` in the function's `options` object (such as a new `offset`):\n\n```js\nfetchMore({\n  variables: {\n    offset: 10,\n    limit: 10\n  },\n});\n```\n\nIn addition to `variables`, you can also optionally provide an entirely different shape of `query` to execute, which can be useful when `fetchMore` needs to fetch only a single field, but the original query contained other unrelated fields. By default, the original query's shape is reused.\n\n> In Apollo Client 2, you would also provide `fetchMore` an `updateQuery` function, which was responsible for merging the followup query's results with your existing cached data. In Apollo Client 3, you instead [define custom `merge` functions](#merging-paginated-results). This enables you to specify all of your pagination logic in a central location, instead of duplicating it everywhere you call `fetchMore`.\n\nFull examples of using `fetchMore` are provided in the detailed documentation for [offset-based pagination](./offset-based) and [cursor-based pagination](./cursor-based). The rest of this article covers the field policy configuration API that allows application code to call `fetchMore` without worrying about how incoming data is combined with existing data.\n\n## Merging paginated results\n\n> The example below uses offset-based pagination, but this article applies to all pagination strategies.\n\nTo specify which page of a list field you want to fetch, you usually pass an argument for that field, such as `offset` or `cursor`. This argument's value is different for each query that fetches a different page of the list.\n\nWithout any special configuration, `InMemoryCache` has no understanding of what these arguments mean, so it stores a separate value for each unique combination of arguments. If you examine the internal cache data for a field with arguments, you typically see those arguments serialized and appended to the end of the field name string. This allows multiple distinct values to be stored for a single field within a single entity object.\n\nAlthough this argument-based separation is the safest default policy in most cases, it usually _isn't_ what you want when implementing pagination, because differences in arguments like `offset` and `limit` describe different parts of the same underlying data, rather than entirely separate pieces of data. When dealing with paginated data, it's more convenient for all returned pages to be merged into a _single_ list in your cache. To achieve this behavior, you can configure a **field policy** for the paginated field.\n\n### Defining a field policy\n\nA field policy specifies how a particular field in your `InMemoryCache` is read and written. You can define a field policy to merge the results of paginated queries into a single list.\n\n#### Example\n\nHere's the server-side schema for a message feed application that uses offset-based pagination:\n\n```graphql{2}\ntype Query {\n  feed(offset: Int, limit: Int): [FeedItem!]\n}\n\ntype FeedItem {\n  id: String!\n  message: String!\n}\n```\n\nIn our client, we want to define a field policy for `Query.feed` so that all returned pages of the list are merged into a _single_ list in our cache.\n\nWe define our field policy within the `typePolicies` option we provide the `InMemoryCache` constructor:\n\n```js{5-15}\nconst cache = new InMemoryCache({\n  typePolicies: {\n    Query: {\n      fields: {\n        feed: {\n          // Don't cache separate results based on\n          // any of this field's arguments.\n          keyArgs: false,\n\n          // Concatenate the incoming list items with\n          // the existing list items.\n          merge(existing = [], incoming) {\n            return [...existing, ...incoming];\n          },\n        }\n      }\n    }\n  }\n})\n```\n\nThis field policy specifies the field's `keyArgs`, along with a **`merge` function**. Both of these configurations are necessary for handling pagination:\n\n* `keyArgs` specifies a list of arguments (if any) that cause the cache to store a _separate_ field value for each unique combination of those arguments.\n  * In this case, the cache shouldn't store a separate result based on _any_ of its arguments (`offset` or`limit`), so we disable this behavior entirely by passing `false`. An empty list (`keyArgs: []`) also works, but `keyArgs: false` is more expressive, and it results in a field key that is simply the name of the field (`feed` in this case).\n  * Whenever a particular argument's value could cause items from an _entirely different list_ to be returned for the field, the name of that argument _should_ be included in `keyArgs`.\n  * For more information, see [Specifying key arguments](../caching/cache-field-behavior/#specifying-key-arguments) and [The `keyArgs` API](./key-args).\n* A `merge` function tells the Apollo Client cache how to combine `incoming` data with `existing` cached data for a particular field. Without this function, incoming field values simply _overwrite_ existing field values by default.\n  * For more information, see [The `merge` function](../caching/cache-field-behavior/#the-merge-function).\n\nWith this field policy in place, Apollo Client merges the results of all queries that use the following structure, regardless of argument values:\n\n```ts\n// Client-side query definition\nconst FEED_QUERY = gql`\n  query Feed($offset: Int, $limit: Int) {\n    feed(offset: $offset, limit: $limit) {\n      id\n      message\n    }\n  }\n`;\n```\n\n### Designing the `merge` function\n\nIn [the example above](#example), our `merge` function is a single line:\n\n```js\nmerge(existing = [], incoming) {\n  return [...existing, ...incoming];\n}\n```\n\nThis function makes risky assumptions about the order in which the client requests pages, because it ignores the values of `offset` and `limit`. A more robust `merge` function can use `options.args` to decide where to put `incoming` data relative to `existing` data, like so:\n\n```js\nconst cache = new InMemoryCache({\n  typePolicies: {\n    Query: {\n      fields: {\n        feed: {\n          keyArgs: [],\n          merge(existing, incoming, { args: { offset = 0 }}) {\n            // Slicing is necessary because the existing data is\n            // immutable, and frozen in development.\n            const merged = existing ? existing.slice(0) : [];\n            for (let i = 0; i < incoming.length; ++i) {\n              merged[offset + i] = incoming[i];\n            }\n            return merged;\n          },\n        },\n      },\n    },\n  },\n});\n```\n\nThis logic handles sequential page writes the same way the single-line strategy does, but it can also tolerate repeated, overlapping, or out-of-order writes, without duplicating any list items.\n\n## `read` functions for paginated fields\n\nAs shown above, a `merge` function helps you combine paginated query results from your GraphQL server into a single list in your client cache. But what if you also want to configure how that locally cached list is _read_? For that, you can define a **`read` function**.\n\nYou define a `read` function for a field within its [field policy](#defining-a-field-policy), alongside the `merge` function and `keyArgs`. If you define a `read` function for a field, the cache calls that function whenever you query the field, passing the field's existing cached value (if any) as the first argument. In the query response, the field will be populated with the `read` function's return value, instead of the existing data.\n\n> If a field policy includes both a `merge` function and a `read` function, the default value of `keyArgs` becomes `false` (i.e., _no_ arguments are key arguments). If either function _isn't_ defined, _all_ of the field's arguments are considered key arguments by default. In either case, you can define `keyArgs` yourself to override the default behavior.\n\nA `read` function for a paginated field typically uses one of the following approaches:\n\n* [Re-pagination](#paginated-read-functions), in which the cached list is split back into pages, based on field arguments\n* [_No_ pagination](#non-paginated-read-functions), in which the cached list is always returned in full\n\nAlthough the \"right\" approach varies from field to field, a [non-paginated `read` function](#non-paginated-read-functions) often works best for infinitely scrolling feeds, since it gives your application code full control over which elements to display at a given time, without requiring any additional cache reads.\n\n### Paginated `read` functions\n\nThe `read` function for a list field can perform client-side re-pagination for that list. It can even transform a page before returning it, such as by sorting or filtering its elements.\n\nThis capability goes beyond returning the same pages that you fetched from your server, because a `read` function for `offset`/`limit` pagination could read from any available `offset`, with any desired `limit`:\n\n```js\nconst cache = new InMemoryCache({\n  typePolicies: {\n    Query: {\n      fields: {\n        feed: {\n          read(existing, { args: { offset, limit }}) {\n            // A read function should always return undefined if existing is\n            // undefined. Returning undefined signals that the field is\n            // missing from the cache, which instructs Apollo Client to\n            // fetch its value from your GraphQL server.\n            return existing && existing.slice(offset, offset + limit);\n          },\n\n          // The keyArgs list and merge function are the same as above.\n          keyArgs: [],\n          merge(existing, incoming, { args: { offset = 0 }}) {\n            const merged = existing ? existing.slice(0) : [];\n            for (let i = 0; i < incoming.length; ++i) {\n              merged[offset + i] = incoming[i];\n            }\n            return merged;\n          },\n        },\n      },\n    },\n  },\n});\n```\n\nDepending on the assumptions you feel comfortable making, you might want to make this code more defensive. For example, you can provide default values for `offset` and `limit`, in case someone fetches `Query.feed` without providing arguments:\n\n```js\nconst cache = new InMemoryCache({\n  typePolicies: {\n    Query: {\n      fields: {\n        feed: {\n          read(existing, {\n            args: {\n              // Default to returning the entire cached list,\n              // if offset and limit are not provided.\n              offset = 0,\n              limit = existing?.length,\n            } = {},\n          }) {\n            return existing && existing.slice(offset, offset + limit);\n          },\n          // ... keyArgs, merge ...\n        },\n      },\n    },\n  },\n});\n```\n\nThis style of `read` function takes responsibility for re-paginating your data based on field arguments, essentially inverting the behavior of your `merge` function. This way, your application can query different pages using different arguments.\n\n### Non-paginated `read` functions\n\nThe `read` function for a paginated field can choose to _ignore_ arguments like `offset` and `limit`, and always return the entire list as it exists in the cache. In this case, your application code takes responsibility for slicing the list into pages depending on your needs.\n\nIf you adopt this approach, you might not need to define a `read` function at all, because the cached list can be returned without any processing. That's why the [`offsetLimitPagination` helper function](./offset-based/#the-offsetlimitpagination-helper) is implemented _without_ a `read` function.\n\nRegardless of how you configure `keyArgs`, your `read` (and `merge`) functions can always examine any arguments passed to the field using the `options.args` object. See [The `keyArgs` API](./key-args) for a deeper discussion of how to reason about dividing argument-handling responsibility between `keyArgs` and your `read` or `merge` functions.\n"}},"__N_SSG":true}