{"pageProps":{"markdownPost":{"name":null,"url":null,"content":"---\nid: release-channels\ntitle: Release Channels\npermalink: docs/release-channels.html\nlayout: docs\ncategory: installation\nprev: cdn-links.html\nnext: hello-world.html\n---\n\nReact relies on a thriving open source community to file bug reports, open pull requests, and [submit RFCs](https://github.com/reactjs/rfcs). To encourage feedback we sometimes share special builds of React that include unreleased features.\n\n> This document will be most relevant to developers who work on frameworks, libraries, or developer tooling. Developers who use React primarily to build user-facing applications should not need to worry about our prerelease channels.\n\nEach of React's release channels is designed for a distinct use case:\n\n- [**Latest**](#latest-channel) is for stable, semver React releases. It's what you get when you install React from npm. This is the channel you're already using today. **Use this for all user-facing React applications.**\n- [**Next**](#next-channel) tracks the master branch of the React source code repository. Think of these as release candidates for the next minor semver release. Use this for integration testing between React and third party projects.\n- [**Experimental**](#experimental-channel) includes experimental APIs and features that aren't available in the stable releases. These also track the master branch, but with additional feature flags turned on. Use this to try out upcoming features before they are released.\n\nAll releases are published to npm, but only Latest uses [semantic versioning](/docs/faq-versioning.html). Prereleases (those in the Next and Experimental channels) have versions generated from a hash of their contents, e.g. `0.0.0-1022ee0ec` for Next and `0.0.0-experimental-1022ee0ec` for Experimental.\n\n**The only officially supported release channel for user-facing applications is Latest**. Next and Experimental releases are provided for testing purposes only, and we provide no guarantees that behavior won't change between releases. They do not follow the semver protocol that we use for releases from Latest.\n\nBy publishing prereleases to the same registry that we use for stable releases, we are able to take advantage of the many tools that support the npm workflow, like [unpkg](https://unpkg.com) and [CodeSandbox](https://codesandbox.io).\n\n### Latest Channel {#latest-channel}\n\nLatest is the channel used for stable React releases. It corresponds to the `latest` tag on npm. It is the recommended channel for all React apps that are shipped to real users.\n\n**If you're not sure which channel you should use, it's Latest.** If you're a React developer, this is what you're already using.\n\nYou can expect updates to Latest to be extremely stable. Versions follow the semantic versioning scheme. Learn more about our commitment to stability and incremental migration in our [versioning policy](/docs/faq-versioning.html).\n\n### Next Channel {#next-channel}\n\nThe Next channel is a prerelease channel that tracks the master branch of the React repository. We use prereleases in the Next channel as release candidates for the Latest channel. You can think of Next as a superset of Latest that is updated more frequently.\n\nThe degree of change between the most recent Next release and the most recent Latest release is approximately the same as you would find between two minor semver releases. However, **the Next channel does not conform to semantic versioning.** You should expect occasional breaking changes between successive releases in the Next channel.\n\n**Do not use prereleases in user-facing applications.**\n\nReleases in Next are published with the `next` tag on npm. Versions are generated from a hash of the build's contents, e.g. `0.0.0-1022ee0ec`.\n\n#### Using the Next Channel for Integration Testing {#using-the-next-channel-for-integration-testing}\n\nThe Next channel is designed to support integration testing between React and other projects.\n\nAll changes to React go through extensive internal testing before they are released to the public. However, there are a myriad of environments and configurations used throughout the React ecosystem, and it's not possible for us to test against every single one.\n\nIf you're the author of a third party React framework, library, developer tool, or similar infrastructure-type project, you can help us keep React stable for your users and the entire React community by periodically running your test suite against the most recent changes. If you're interested, follow these steps:\n\n- Set up a cron job using your preferred continuous integration platform. Cron jobs are supported by both [CircleCI](https://circleci.com/docs/2.0/triggers/#scheduled-builds) and [Travis CI](https://docs.travis-ci.com/user/cron-jobs/).\n- In the cron job, update your React packages to the most recent React release in the Next channel, using `next` tag on npm. Using the npm cli:\n\n  ```\n  npm update react@next react-dom@next\n  ```\n\n  Or yarn:\n\n  ```\n  yarn upgrade react@next react-dom@next\n  ```\n- Run your test suite against the updated packages.\n- If everything passes, great! You can expect that your project will work with the next minor React release.\n- If something breaks unexpectedly, please let us know by [filing an issue](https://github.com/facebook/react/issues).\n\nA project that uses this workflow is Next.js. (No pun intended! Seriously!) You can refer to their [CircleCI configuration](https://github.com/zeit/next.js/blob/c0a1c0f93966fe33edd93fb53e5fafb0dcd80a9e/.circleci/config.yml) as an example.\n\n### Experimental Channel {#experimental-channel}\n\nLike Next, the Experimental channel is a prerelease channel that tracks the master branch of the React repository. Unlike Next, Experimental releases include additional features and APIs that are not ready for wider release.\n\nUsually, an update to Next is accompanied by a corresponding update to Experimental. They are based on the same source revision, but are built using a different set of feature flags.\n\nExperimental releases may be significantly different than releases to Next and Latest. **Do not use Experimental releases in user-facing applications.** You should expect frequent breaking changes between releases in the Experimental channel.\n\nReleases in Experimental are published with the `experimental` tag on npm. Versions are generated from a hash of the build's contents, e.g. `0.0.0-experimental-1022ee0ec`.\n\n#### What Goes Into an Experimental Release? {#what-goes-into-an-experimental-release}\n\nExperimental features are ones that are not ready to be released to the wider public, and may change drastically before they are finalized. Some experiments may never be finalized -- the reason we have experiments is to test the viability of proposed changes.\n\nFor example, if the Experimental channel had existed when we announced Hooks, we would have released Hooks to the Experimental channel weeks before they were available in Latest.\n\nYou may find it valuable to run integration tests against Experimental. This is up to you. However, be advised that Experimental is even less stable than Next. **We do not guarantee any stability between Experimental releases.**\n\n#### How Can I Learn More About Experimental Features? {#how-can-i-learn-more-about-experimental-features}\n\nExperimental features may or may not be documented. Usually, experiments aren't documented until they are close to shipping in Next or Latest.\n\nIf a feature is not documented, they may be accompanied by an [RFC](https://github.com/reactjs/rfcs).\n\nWe will post to the [React blog](/blog) when we're ready to announce new experiments, but that doesn't mean we will publicize every experiment.\n\nYou can always refer to our public GitHub repository's [history](https://github.com/facebook/react/commits/master) for a comprehensive list of changes.\n"}},"__N_SSG":true}