{"pageProps":{"markdownPost":{"name":null,"url":null,"content":"---\ndescription:\n  Next.js' Fast Refresh is a new hot reloading experience that gives you\n  instantaneous feedback on edits made to your React components.\n---\n\n# Fast Refresh\n\n<details open>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"https://github.com/vercel/next.js/tree/canary/examples/fast-refresh-demo\">Fast Refresh Demo</a></li>\n  </ul>\n</details>\n\nFast Refresh is a Next.js feature that gives you instantaneous feedback on\nedits made to your React components. Fast Refresh is enabled by default in all\nNext.js applications on **9.4 or newer**. With Next.js Fast Refresh enabled,\nmost edits should be visible within a second, **without losing component\nstate**.\n\n## How It Works\n\n- If you edit a file that **only exports React component(s)**, Fast Refresh will\n  update the code only for that file, and re-render your component. You can edit\n  anything in that file, including styles, rendering logic, event handlers, or\n  effects.\n- If you edit a file with exports that _aren't_ React components, Fast Refresh\n  will re-run both that file, and the other files importing it. So if both\n  `Button.js` and `Modal.js` import `theme.js`, editing `theme.js` will update\n  both components.\n- Finally, if you **edit a file** that's **imported by files outside of the\n  React tree**, Fast Refresh **will fall back to doing a full reload**. You\n  might have a file which renders a React component but also exports a value\n  that is imported by a **non-React component**. For example, maybe your\n  component also exports a constant, and a non-React utility file imports it. In\n  that case, consider migrating the constant to a separate file and importing it\n  into both files. This will re-enable Fast Refresh to work. Other cases can\n  usually be solved in a similar way.\n\n## Error Resilience\n\n### Syntax Errors\n\nIf you make a syntax error during development, you can fix it and save the file\nagain. The error will disappear automatically, so you won't need to reload the\napp. **You will not lose component state**.\n\n### Runtime Errors\n\nIf you make a mistake that leads to a runtime error inside your component,\nyou'll be greeted with a contextual overlay. Fixing the error will automatically\ndismiss the overlay, without reloading the app.\n\nComponent state will be retained if the error did not occur during rendering. If\nthe error did occur during rendering, React will remount your application using\nthe updated code.\n\nIf you have [error boundaries](https://reactjs.org/docs/error-boundaries.html)\nin your app (which is a good idea for graceful failures in production), they\nwill retry rendering on the next edit after a rendering error. This means having\nan error boundary can prevent you from always getting reset to the root app\nstate. However, keep in mind that error boundaries shouldn't be _too_ granular.\nThey are used by React in production, and should always be designed\nintentionally.\n\n## Limitations\n\nFast Refresh tries to preserve local React state in the component you're\nediting, but only if it's safe to do so. Here's a few reasons why you might see\nlocal state being reset on every edit to a file:\n\n- Local state is not preserved for class components (only function components\n  and Hooks preserve state).\n- The file you're editing might have _other_ exports in addition to a React\n  component.\n- Sometimes, a file would export the result of calling higher-order component\n  like `HOC(WrappedComponent)`. If the returned component is a\n  class, state will be reset.\n- Anonymous arrow functions like `export default () => <div />;` cause Fast Refresh to not preserve local component state. For large codebases you can use our [`name-default-component` codemod](/docs/advanced-features/codemods.md#name-default-component).\n\nAs more of your codebase moves to function components and Hooks, you can expect\nstate to be preserved in more cases.\n\n## Tips\n\n- Fast Refresh preserves React local state in function components (and Hooks) by\n  default.\n- Sometimes you might want to _force_ the state to be reset, and a component to\n  be remounted. For example, this can be handy if you're tweaking an animation\n  that only happens on mount. To do this, you can add `// @refresh reset`\n  anywhere in the file you're editing. This directive is local to the file, and\n  instructs Fast Refresh to remount components defined in that file on every\n  edit.\n- You can put `console.log` or `debugger;` into the components you edit during\n  development.\n\n## Fast Refresh and Hooks\n\nWhen possible, Fast Refresh attempts to preserve the state of your component\nbetween edits. In particular, `useState` and `useRef` preserve their previous\nvalues as long as you don't change their arguments or the order of the Hook\ncalls.\n\nHooks with dependencies—such as `useEffect`, `useMemo`, and `useCallback`—will\n_always_ update during Fast Refresh. Their list of dependencies will be ignored\nwhile Fast Refresh is happening.\n\nFor example, when you edit `useMemo(() => x * 2, [x])` to\n`useMemo(() => x * 10, [x])`, it will re-run even though `x` (the dependency)\nhas not changed. If React didn't do that, your edit wouldn't reflect on the\nscreen!\n\nSometimes, this can lead to unexpected results. For example, even a `useEffect`\nwith an empty array of dependencies would still re-run once during Fast Refresh.\n\nHowever, writing code resilient to occasional re-running of `useEffect` is a good practice even\nwithout Fast Refresh. It will make it easier for you to introduce new dependencies to it later on\nand it's enforced by [React Strict Mode](/docs/api-reference/next.config.js/react-strict-mode.md),\nwhich we highly recommend enabling.\n"}},"__N_SSG":true}