{"pageProps":{"markdownPost":{"name":null,"url":null,"content":"---\nid: strict-mode\ntitle: Strict Mode\npermalink: docs/strict-mode.html\n---\n\n`StrictMode` is a tool for highlighting potential problems in an application. Like `Fragment`, `StrictMode` does not render any visible UI. It activates additional checks and warnings for its descendants.\n\n> Note:\n>\n> Strict mode checks are run in development mode only; _they do not impact the production build_.\n\nYou can enable strict mode for any part of your application. For example:\n`embed:strict-mode/enabling-strict-mode.js`\n\nIn the above example, strict mode checks will *not* be run against the `Header` and `Footer` components. However, `ComponentOne` and `ComponentTwo`, as well as all of their descendants, will have the checks.\n\n`StrictMode` currently helps with:\n* [Identifying components with unsafe lifecycles](#identifying-unsafe-lifecycles)\n* [Warning about legacy string ref API usage](#warning-about-legacy-string-ref-api-usage)\n* [Warning about deprecated findDOMNode usage](#warning-about-deprecated-finddomnode-usage)\n* [Detecting unexpected side effects](#detecting-unexpected-side-effects)\n* [Detecting legacy context API](#detecting-legacy-context-api)\n\nAdditional functionality will be added with future releases of React.\n\n### Identifying unsafe lifecycles {#identifying-unsafe-lifecycles}\n\nAs explained [in this blog post](/blog/2018/03/27/update-on-async-rendering.html), certain legacy lifecycle methods are unsafe for use in async React applications. However, if your application uses third party libraries, it can be difficult to ensure that these lifecycles aren't being used. Fortunately, strict mode can help with this!\n\nWhen strict mode is enabled, React compiles a list of all class components using the unsafe lifecycles, and logs a warning message with information about these components, like so:\n\n![](../images/blog/strict-mode-unsafe-lifecycles-warning.png)\n\nAddressing the issues identified by strict mode _now_ will make it easier for you to take advantage of concurrent rendering in future releases of React.\n\n### Warning about legacy string ref API usage {#warning-about-legacy-string-ref-api-usage}\n\nPreviously, React provided two ways for managing refs: the legacy string ref API and the callback API. Although the string ref API was the more convenient of the two, it had [several downsides](https://github.com/facebook/react/issues/1373) and so our official recommendation was to [use the callback form instead](/docs/refs-and-the-dom.html#legacy-api-string-refs).\n\nReact 16.3 added a third option that offers the convenience of a string ref without any of the downsides:\n`embed:16-3-release-blog-post/create-ref-example.js`\n\nSince object refs were largely added as a replacement for string refs, strict mode now warns about usage of string refs.\n\n> **Note:**\n>\n> Callback refs will continue to be supported in addition to the new `createRef` API.\n>\n> You don't need to replace callback refs in your components. They are slightly more flexible, so they will remain as an advanced feature.\n\n[Learn more about the new `createRef` API here.](/docs/refs-and-the-dom.html)\n\n### Warning about deprecated findDOMNode usage {#warning-about-deprecated-finddomnode-usage}\n\nReact used to support `findDOMNode` to search the tree for a DOM node given a class instance. Normally you don't need this because you can [attach a ref directly to a DOM node](/docs/refs-and-the-dom.html#creating-refs).\n\n`findDOMNode` can also be used on class components but this was breaking abstraction levels by allowing a parent to demand that certain children was rendered. It creates a refactoring hazard where you can't change the implementation details of a component because a parent might be reaching into its DOM node. `findDOMNode` only returns the first child, but with the use of Fragments, it is possible for a component to render multiple DOM nodes. `findDOMNode` is a one time read API. It only gave you an answer when you asked for it. If a child component renders a different node, there is no way to handle this change. Therefore `findDOMNode` only worked if components always return a single DOM node that never changes.\n\nYou can instead make this explicit by passing a ref to your custom component and pass that along to the DOM using [ref forwarding](/docs/forwarding-refs.html#forwarding-refs-to-dom-components).\n\nYou can also add a wrapper DOM node in your component and attach a ref directly to it.\n\n```javascript{4,7}\nclass MyComponent extends React.Component {\n  constructor(props) {\n    super(props);\n    this.wrapper = React.createRef();\n  }\n  render() {\n    return <div ref={this.wrapper}>{this.props.children}</div>;\n  }\n}\n```\n\n> Note:\n>\n> In CSS, the [`display: contents`](https://developer.mozilla.org/en-US/docs/Web/CSS/display#display_contents) attribute can be used if you don't want the node to be part of the layout.\n\n### Detecting unexpected side effects {#detecting-unexpected-side-effects}\n\nConceptually, React does work in two phases:\n* The **render** phase determines what changes need to be made to e.g. the DOM. During this phase, React calls `render` and then compares the result to the previous render.\n* The **commit** phase is when React applies any changes. (In the case of React DOM, this is when React inserts, updates, and removes DOM nodes.) React also calls lifecycles like `componentDidMount` and `componentDidUpdate` during this phase.\n\nThe commit phase is usually very fast, but rendering can be slow. For this reason, the upcoming concurrent mode (which is not enabled by default yet) breaks the rendering work into pieces, pausing and resuming the work to avoid blocking the browser. This means that React may invoke render phase lifecycles more than once before committing, or it may invoke them without committing at all (because of an error or a higher priority interruption).\n\nRender phase lifecycles include the following class component methods:\n* `constructor`\n* `componentWillMount` (or `UNSAFE_componentWillMount`)\n* `componentWillReceiveProps` (or `UNSAFE_componentWillReceiveProps`)\n* `componentWillUpdate` (or `UNSAFE_componentWillUpdate`)\n* `getDerivedStateFromProps`\n* `shouldComponentUpdate`\n* `render`\n* `setState` updater functions (the first argument)\n\nBecause the above methods might be called more than once, it's important that they do not contain side-effects. Ignoring this rule can lead to a variety of problems, including memory leaks and invalid application state. Unfortunately, it can be difficult to detect these problems as they can often be [non-deterministic](https://en.wikipedia.org/wiki/Deterministic_algorithm).\n\nStrict mode can't automatically detect side effects for you, but it can help you spot them by making them a little more deterministic. This is done by intentionally double-invoking the following functions:\n\n* Class component `constructor`, `render`, and `shouldComponentUpdate` methods\n* Class component static `getDerivedStateFromProps` method\n* Function component bodies\n* State updater functions (the first argument to `setState`)\n* Functions passed to `useState`, `useMemo`, or `useReducer`\n\n> Note:\n>\n> This only applies to development mode. _Lifecycles will not be double-invoked in production mode._\n\nFor example, consider the following code:\n`embed:strict-mode/side-effects-in-constructor.js`\n\nAt first glance, this code might not seem problematic. But if `SharedApplicationState.recordEvent` is not [idempotent](https://en.wikipedia.org/wiki/Idempotence#Computer_science_meaning), then instantiating this component multiple times could lead to invalid application state. This sort of subtle bug might not manifest during development, or it might do so inconsistently and so be overlooked.\n\nBy intentionally double-invoking methods like the component constructor, strict mode makes patterns like this easier to spot.\n\n> Note:\n>\n> Starting with React 17, React automatically modifies the console methods like `console.log()` to silence the logs in the second call to lifecycle functions. However, it may cause undesired behavior in certain cases where [a workaround can be used](https://github.com/facebook/react/issues/20090#issuecomment-715927125).\n\n### Detecting legacy context API {#detecting-legacy-context-api}\n\nThe legacy context API is error-prone, and will be removed in a future major version. It still works for all 16.x releases but will show this warning message in strict mode:\n\n![](../images/blog/warn-legacy-context-in-strict-mode.png)\n\nRead the [new context API documentation](/docs/context.html) to help migrate to the new version.\n"}},"__N_SSG":true}