{"pageProps":{"markdownPost":{"name":null,"url":null,"content":"<!--[meta]\nsection: guides\ntitle: Custom schema\nsubSection: advanced\n[meta]-->\n\n# Custom schema\n\nOut of the box, Keystone provides predictable CRUD (Create, Read, Update, Delete) GraphQL operations for [Lists](/docs/guides/schema.md#lists). They are the primary methods for updating list data and should be enough for most applications. However, custom types, queries and mutations may be added if you wish to preform non-CRUD operations.\n\n> **Tip:** See the [GraphQL philosophy](/docs/guides/graphql-philosophy.md) page for more information on how Keystone implements CRUD operations in GraphQL and when custom schema may be required.\n\nAdding to Keystone's generated schema can be done using the [`keystone.extendGraphQLSchema`](/packages/keystone/README.md#extendgraphqlschemaconfig) method.\n\n## The problem\n\nA common situation where custom schema would be beneficial is incrementing a value stored in the database.\n\nFirst let's define a `Page` list. For the sake of simplicity, we'll give it only two fields: `title` and `views`.\n\n```js title=/lists/Page.js\nconst { Text, Integer } = require('@keystonejs/fields');\n\nconst pageList = keystone.createList('Page', {\n  fields: {\n    title: { type: Text },\n    views: { type: Integer },\n  },\n});\n```\n\nIf we had a front-end application that updated the view count every time someone visits the page it would require multiple CRUD operations.\n\nUsing CRUD we'd first have to fetch the current view count:\n\n```graphql\nquery Page($id: ID!) {\n  Page(where: { id: $id }) {\n    views\n  }\n}\n```\n\nOnce we have the view count we could increment this value with JavaScript and send an `updatePage` mutation to save the new value:\n\n```graphql\nmutation updatePageViews($id: ID!, $views: Int!) {\n  updatePage(id: $id, data: { views: $views }) {\n    views\n  }\n}\n```\n\n### Why is this bad?\n\nThe problem with this approach is that the client can set the view count to any arbitrary value. Moreover, even if there is no untoward manipulation of the count, the GraphQL server is trusting that the update mutation is received from the same client immediately after the view query. On heavily trafficked sites this will not always be the case. Read and Update requests from multiple clients can be received in any order depending on the speed of their internet connections, which means updates could override one another.\n\n## The solution\n\nLike any problem, there are multiple solutions. You could implement an incrementing value with [Hooks](/docs/guides/hooks.md), but in this example we're going to look at how to do this with a custom GraphQL mutation which will perform the incrementation on the server.\n\nFor this example, we will be adding three things to Keystone's GraphQL schema:\n\n1. A custom [**type**](#custom-type) which will be returned by our mutation.\n2. A custom [**mutation**](#custom-mutation) which will increment the page views.\n3. A custom [**query**](#custom-query) which will check if the current page views are over a certain threshold.\n\n> **Note:** This custom query is somewhat superfluous; you could just query the page directly and check the views client-side. However, it serves to illustrate how custom queries are set up.\n\n### Custom type\n\nFirst, let's define what we want our custom GraphQL type to look like:\n\n> **Tip:** You can [learn more about schemas and types](https://graphql.org/learn/schema/) on <https://graphql.org>. You can also find a reference of all the types generated by Keystone in built-in GraphQL Playground's Schema tab, accessible via the Admin UI.\n\n```graphql\ntype IncrementPageViewsOutput {\n  # The new page views after the mutation.\n  currentViews: Int!\n\n  # The time and date when the page was viewed.\n  timestamp: String!\n}\n```\n\nWe can register this type with Keystone using the `keystone.extendGraphQLSchema()` method, like so. Note the `type` key simply takes the definition as a string:\n\n```javascript title=/lists/Page.js\nkeystone.extendGraphQLSchema({\n  types: [\n    {\n      type: 'type IncrementPageViewsOutput { currentViews: Int!, timestamp: String! }',\n    },\n  ],\n});\n```\n\n### Custom mutation\n\nNext, let's define our custom mutation to actually handle the view count incrementation:\n\n```graphql\nincrementPageViews(id: ID!): IncrementPageViewsOutput\n```\n\nThis defines a mutation called `incrementPageViews` that accepts a single mandatory `id` argument of type `ID` (an internal GraphQL type). This is the id of the specific `Post` whose views you wish to increment. Finally, the mutation returns an object of our custom `IncrementPageViewsOutput` type.\n\nNow, to wire it in:\n\n```diff title=/lists/Page.js\n keystone.extendGraphQLSchema({\n   types: [\n     {\n       type: 'type IncrementPageViewsOutput { currentViews: Int!, timestamp: String! }',\n     },\n   ],\n+  mutations: [\n+    {\n+      schema: 'incrementPageViews(id: ID!): IncrementPageViewsOutput',\n+      resolver: incrementPageViews,\n+    },\n+  ],\n });\n```\n\nCustom mutations (and queries) take a `schema` and a `resolver` key. Like with the custom type's `type` key, `schema` is simply the custom mutation definition, while `resolver` is a function which tells the GraphQL server how to execute this mutation. In our case, it must return an `IncrementPageViewsOutput` object.\n\n> **Note:** Refer to the [`keystone.extendGraphQLSchema`](/packages/keystone/README.md#extendgraphqlschemaconfig) API documentation for details on the `resolver` function's signature.\n\nLet's define the resolver function:\n\n```javascript title=/lists/Page.js\nconst incrementPageViews = async (_, { id }) => {\n  // pageList was defined above when we created the Page list\n  const { adapter } = pageList;\n\n  const oldItem = await adapter.findById(id);\n  const newItem = await adapter.update(id, {\n    ...oldItem,\n    views: ++(oldItem.views || 0),\n  });\n\n  return {\n    currentViews: newItem.views,\n    timestamp: new Date().toUTCString(),\n  };\n};\n```\n\n> **Note:** The value of `views` may be `undefined` initially, so before we increment it we make sure to convert any `falsey` values to `0`.\n\nOur custom mutation is now available to the client! It can be utilized like so:\n\n```graphql\nmutation incrementPageViews($id: ID!) {\n  incrementPageViews(id: $id) {\n    currentViews\n    timestamp\n  }\n}\n```\n\n### Custom query\n\nFinally, let's define a custom query that checks if a page's views are over a certain threshold.\n\n```graphql\npageViewsOver(id: ID!, threshold: Integer!): Boolean\n```\n\nThis defines a query called `pageViewsOver`. It requires two arguments: an `id` (just like our mutation) and an integer `threshold`. It will true if the `Post` with the given id has been viewed more than the specified number of times, false otherwise.\n\nAdd the query alongside our custom type and mutation. Note that custom queries take the same `schema` and `resolver` keys as custom mutations.\n\n```diff title=/lists/Page.js\n keystone.extendGraphQLSchema({\n   types: [\n     {\n       type: 'type IncrementPageViewsOutput { currentViews: Int!, timestamp: String! }',\n     },\n   ],\n   mutations: [\n     {\n       schema: 'incrementPageViews(id: ID!): IncrementPageViewsOutput',\n       resolver: incrementPageViews,\n     },\n   ],\n+  queries: [\n+    {\n+      schema: 'pageViewsOver(id: ID!, threshold: Integer!): Boolean',\n+      resolver: pageViewsOver,\n+    },\n+  ],\n });\n```\n\nAnd finally, define our query's resolver:\n\n```javascript\nconst pageViewsOver = async (_, { id, threshold }, context) => {\n  const {\n    data: { views },\n  } = await context.executeGraphql({\n    query: `\n    Post(where: { id: \"${id}\" }) {\n      views\n    }\n  `,\n  });\n\n  return views > threshold;\n};\n```\n\n> **Note:** As shown here, resolvers can execute further GraphQL operations of their own.\n\n## Conclusion\n\nAs you can see, custom schema can be used to augment Keystone's existing GraphQL functionality in various ways. Custom mutations can be used for actions like incrementation that require a single operation that should not rely on data from the client, but they can also be used for operations that have side effects not related to updating lists.\n\n> **Reminder:** We used a custom mutation to increase the reliability of operations like incrementation because client requests can be received out of order.\n\nWhilst a custom mutation is a huge improvement over a client-side query-then-mutate solution, it is not completely transactional in every situation. The `incrementPageViews` function is asynchronous. This means it awaits database operations like `findById` and `update`. Depending on your server environment database operations, just like http requests, can be returned in a different order than executed in JavaScript.\n\nIn this example we've reduced the window this can occur in from seconds to milliseconds. It's not likely a problem for simple page views, but you may want to consider implementing database transactions where accuracy is absolutely critical.\n"}},"__N_SSG":true}